app/views/sectors/show.html.erb

<p class='mb-5'>
    <%= pluralize @sector.companies.count, "company" %> within Top 109 Nasdaq companies in this sector
---
SELECT "companies".* FROM "companies" WHERE "companies"."sector_id" = ? ORDER BY Rank_by_MarketCap  [["sector_id", 71]]
SELECT COUNT(*) FROM "companies" WHERE "companies"."sector_id" = ?  [["sector_id", 87]]