app/views/industries/show.html.erb

SELECT "companies".* FROM "companies" WHERE "companies"."industry_id" = ? ORDER BY Rank_by_MarketCap  [["industry_id", 300]]
SELECT COUNT(*) FROM "companies" WHERE "companies"."industry_id" = ?  [["industry_id", 381]]
---
<p class='mb-5'>
    <%= pluralize @industry.companies.count, "company" %> within Top 109 Nasdaq companies in this industry