app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies" ORDER BY Rank_by_MarketCap
SELECT "industries".* FROM "industries" WHERE "industries"."id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "sectors".* FROM "sectors" WHERE "sectors"."id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)  [["id", 71], ["id", 72], ["id", 73], ["id", 74], ["id", 75], ["id", 76], ["id", 77], ["id", 78], ["id", 79], ["id", 80], ["id", 81], ["id", 82], ["id", 83], ["id", 84]]
---
  def index
    @companies = Company.includes(:industry, :sector).all.order("Rank_by_MarketCap")

SELECT "companies".* FROM "companies" WHERE (name LIKE '%meta%')
---
  def search
    wildcard_search = "%#{params[:keywords]}%"
    @companies = Company.where('name LIKE ?', wildcard_search)