app/controllers/home_controller.rb

  def index
    @companies = Company.includes(:industry, :sector).order("Rank_by_MarketCap").limit(100)
---
SELECT "industries".* FROM "industries" WHERE "industries"."id" IN (?, ?, ?, ?, ?, ?, ?)  [["id", 295], ["id", 296], ["id", 297], ["id", 298], ["id", 299], ["id", 300], ["id", 301]]
SELECT "sectors".* FROM "sectors" WHERE "sectors"."id" IN (?, ?, ?)  [["id", 71], ["id", 72], ["id", 73]]