app/controllers/industries_controller.rb

SELECT industries.*, COUNT(industries.id) as company_count FROM "industries" LEFT OUTER JOIN "companies" ON "companies"."industry_id" = "industries"."id" GROUP BY "industries"."id" ORDER BY company_count DESC
---
  def index
    @industries = Industry.select("industries.*")
                          .select("COUNT(industries.id) as company_count")
                          .left_joins(:companies)
                          .group("industries.id")
                          .order("industries.name")

SELECT "industries".* FROM "industries" WHERE "industries"."id" = ? LIMIT ?  [["id", 300], ["LIMIT", 1]]
SELECT "companies".* FROM "companies" WHERE "companies"."industry_id" = ? ORDER BY Rank_by_MarketCap  [["industry_id", 300]]
---
  def show
    @industry = Industry.find(params[:id])
    @companies = @industry.companies.order("Rank_by_MarketCap")