app/controllers/sectors_controller.rb

SELECT sectors.*, COUNT(sectors.id) as company_count FROM "sectors" LEFT OUTER JOIN "companies" ON "companies"."sector_id" = "sectors"."id" GROUP BY "sectors"."id" ORDER BY company_count DESC
---
  def index
    @sectors = Sector.select("sectors.*")
    .select("COUNT(sectors.id) as company_count")
    .left_joins(:companies)
    .group("sectors.id")
    .order("sectors.name")

SELECT "sectors".* FROM "sectors" WHERE "sectors"."id" = ? LIMIT ?  [["id", 100], ["LIMIT", 1]]
SELECT "companies".* FROM "companies" WHERE "companies"."sector_id" = ? ORDER BY Rank_by_MarketCap  [["sector_id", 71]]
---
  def show
    @sector = Sector.find(params[:id])
    @companies = @sector.companies.order("Rank_by_MarketCap")